<script setup>



</script>

<template>
    <section class="pb-24 relative bg-blue-500 overflow-hidden">
        <div class="bg-gradient-to-t from-blue-500 from-60% lg:from-60%  w-full h-[2000px] absolute z-10"></div>

        <img class="absolute top-0 z-0 opacity-40 w-[600vw] max-w-max md:w-full min-h-[1000px] h-screen object-cover"
            src="/assets/img/career/img.jpg" alt="Image">

        <div class="container mx-auto relative z-20 pt-32 md:pt-64">
            <h1 data-aos="fade-up"
                class="md:text-5xl lg:text-6xl text-3xl text-white font-normalidad font-bold mb-5 md:mb-12">
                Карьера
            </h1>
            <div data-aos="fade-up" data-aos-delay="100" class="justify-between items-center mb-10 lg:mb-48">
                <p class="md:text-lg text-white text-sm mb-7 max-w-[548px]">
                    Для достижения амбициозных целей мы объединяем лучших. Специалисты компании имеют многолетний опыт
                    создания проектов, которые меняют города и делают комфортнее жизнь их обитателей. Если вы хотите
                    изменить мир вместе с нами, присоединяйтесь к команде SAGA Development.
                </p>
                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g clip-path="url(#clip0_674_13877)">
                        <path
                            d="M-0.00120741 14.7875C-0.00215917 14.623 0.0293712 14.4599 0.0915775 14.3076C0.153784 14.1553 0.245441 14.0168 0.361294 13.9C0.477497 13.7829 0.615747 13.6899 0.76807 13.6264C0.920395 13.5629 1.08378 13.5303 1.24879 13.5303C1.41381 13.5303 1.57719 13.5629 1.72951 13.6264C1.88184 13.6899 2.02009 13.7829 2.13629 13.9L12.3488 24.1125C13.0519 24.8148 14.005 25.2092 14.9988 25.2092C15.9925 25.2092 16.9457 24.8148 17.6488 24.1125L27.8613 13.9C27.9778 13.7835 28.1162 13.691 28.2685 13.6279C28.4208 13.5649 28.584 13.5324 28.7488 13.5324C29.0817 13.5324 29.4009 13.6646 29.6363 13.9C29.8717 14.1354 30.0039 14.4546 30.0039 14.7875C30.0039 15.1204 29.8717 15.4396 29.6363 15.675L19.4238 25.8875C18.8432 26.4696 18.1535 26.9313 17.3942 27.2464C16.6349 27.5615 15.8209 27.7237 14.9988 27.7237C14.1767 27.7237 13.3627 27.5615 12.6034 27.2464C11.8441 26.9313 11.1544 26.4696 10.5738 25.8875L0.361294 15.675C0.245441 15.5582 0.153784 15.4197 0.0915775 15.2674C0.0293712 15.1151 -0.00215918 14.952 -0.00120741 14.7875Z"
                            fill="white"/>
                        <path
                            d="M-0.00120741 2.28764C-0.00215917 2.12313 0.0293712 1.96006 0.0915775 1.80776C0.153784 1.65546 0.245441 1.51694 0.361294 1.40014C0.477497 1.28298 0.615747 1.18999 0.76807 1.12653C0.920395 1.06307 1.08378 1.03039 1.24879 1.03039C1.41381 1.03039 1.57719 1.06307 1.72951 1.12653C1.88184 1.18999 2.02009 1.28298 2.13629 1.40014L14.1113 13.3876C14.2275 13.5048 14.3657 13.5978 14.5181 13.6613C14.6704 13.7247 14.8338 13.7574 14.9988 13.7574C15.1638 13.7574 15.3272 13.7247 15.4795 13.6613C15.6318 13.5978 15.7701 13.5048 15.8863 13.3876L27.8613 1.40014C28.0967 1.16476 28.4159 1.03253 28.7488 1.03253C29.0817 1.03253 29.4009 1.16476 29.6363 1.40014C29.8717 1.63552 30.0039 1.95477 30.0039 2.28764C30.0039 2.62052 29.8717 2.93976 29.6363 3.17514L17.6488 15.1501C16.9457 15.8524 15.9925 16.2468 14.9988 16.2468C14.005 16.2468 13.0519 15.8524 12.3488 15.1501L0.361294 3.17514C0.245441 3.05834 0.153784 2.91982 0.0915775 2.76753C0.0293712 2.61523 -0.00215918 2.45215 -0.00120741 2.28764Z"
                            fill="white" fill-opacity="0.3"/>
                    </g>
                    <defs>
                        <clipPath id="clip0_674_13877">
                            <rect width="30" height="30" fill="white" transform="translate(30) rotate(90)" />
                        </clipPath>
                    </defs>
                </svg>
            </div>

            
            <PagesCareerItem/>
            <PagesCareerItem/>
        </div>

        <div class="absolute -right-[72px] top-[250px] w-36 z-10">
            <img src="/assets/img/icons/vector-logo.svg" alt="vector-logo">
        </div>

    </section>
</template>