<template>

  <section id="location" class="map py-14 md:py-24 relative overflow-hidden">
    <div class="absolute lg:-right-36 top-0 lg:top-0 lg:left-auto lg:bottom-40 -left-14 w-28 lg:w-72 z-[2]">
      <img src="/assets/img/icons/vector-logo.svg" class="" alt="vector-logo">
    </div>
    <div class="absolute lg:-left-36 top-0 lg:top-auto lg:right-auto lg:bottom-40 -left-14 w-28 lg:w-72 z-[2]">
      <img src="/assets/img/icons/vector-logo.svg" class="" alt="vector-logo">
    </div>
    <div class="container relative z-10">
      <h2 data-aos="fade-up" class="font-bold text-white text-3xl text-center mb-8 lg:hidden">
        Топовая локация
      </h2>

      <div class="overflow-hidden rounded-t-2xl mb-7 md:mb-0 lg:rounded-none lg:rounded-t-2xl">
        <!-- <img src="/assets/img/about/map.jpg" class="scale-150 lg:scale-100" alt="map ph"> -->
        <!-- <iframe
          src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d20587.053357881974!2d36.66047509044602!3d49.83528567477884!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x412715b15ca991f5%3A0xb47eee1e7df4b5c2!2z0KfRg9Cz0YPQtdCyLCDQpdCw0YDRjNC60L7QstGB0LrQsNGPINC-0LHQu9Cw0YHRgtGMLCA2MzUwMA!5e0!3m2!1sru!2sua!4v1717136555168!5m2!1sru!2sua"
          allowfullscreen="" loading="lazy"
          class="w-full h-[700px] border-none"
          referrerpolicy="no-referrer-when-downgrade"></iframe> -->

        <!-- <iframe src="https://www.google.com/maps/d/u/0/edit?mid=1eQ_MuJRI84FyOBXEQNonemBuQKR1hfo&usp=sharing" width="640" height="480"></iframe> -->




        <!-- <iframe src="https://www.google.com/maps/d/embed?mid=1eQ_MuJRI84FyOBXEQNonemBuQKR1hfo&ehbc=2E312F"
          class="w-full h-[700px] border-none -mt-[100px]"></iframe> -->


        <div id="map"></div>
      </div>

      <div
        class="flex flex-col md:flex-row mt-[30px] md:items-center md:justify-between md:gap-[30px] gap-5 md:py-10 md:px-7 md:border md:border-whiteOp-300 md:rounded-b-2xl md:mt-[-1px]">
        <p class=" text-white text-base text-center md:text-start md:text-xl lg:text-left lg:m-0">
          Если вы на острове,
          мы с радостью проведём вам экскурсию по объекту!
        </p>
        <button @click="handleOpenModal" type="button" class="white-button px-7 mx-auto lg:mx-0 xl:px-[60px]">
          Записаться на просмотр
        </button>
      </div>
    </div>
  </section>

</template>

<style scoped>
#map {
  height: 500px;
  width: 100%;
}
@media (min-width: 1441px) {
  #map {
    height: 700px;
  }
}
</style>


<script setup>
import { ref, watch } from 'vue'

const modalsStore = useModalsStore()

const props = defineProps(['itemData']);

const handleOpenModal = () => {
  modalsStore.addModal('presentation')
}

setTimeout(() => {
  (g => { var h, a, k, p = "The Google Maps JavaScript API", c = "google", l = "importLibrary", q = "__ib__", m = document, b = window; b = b[c] || (b[c] = {}); var d = b.maps || (b.maps = {}), r = new Set, e = new URLSearchParams, u = () => h || (h = new Promise(async (f, n) => { await (a = m.createElement("script")); e.set("libraries", [...r] + ""); for (k in g) e.set(k.replace(/[A-Z]/g, t => "_" + t[0].toLowerCase()), g[k]); e.set("callback", c + ".maps." + q); a.src = `https://maps.${c}apis.com/maps/api/js?` + e; d[q] = f; a.onerror = () => h = n(Error(p + " could not load.")); a.nonce = m.querySelector("script[nonce]")?.nonce || ""; m.head.append(a) })); d[l] ? console.warn(p + " only loads once. Ignoring:", g) : d[l] = (f, ...n) => r.add(f) && u().then(() => d[l](f, ...n)) })({
  key: "AIzaSyC7ViT10AIDD-Qgtd0TN24tT-pR0RdOmGA",
  v: "weekly",
  // Use the 'v' parameter to indicate the version to use (weekly, beta, alpha, etc.).
  // Add other bootstrap parameters as needed, using camel case.
});
}, 10)


let map;

async function initMap(cood1, cood2) {

  const position = { lat: cood1 ?? 0, lng: cood2 ?? 0 };
  const { Map } = await google.maps.importLibrary("maps");
  const { AdvancedMarkerElement } = await google.maps.importLibrary("marker");

  map = new Map(document.getElementById("map"), {
    zoom: 14,
    center: position,
    mapId: "DEMO_MAP_ID",
  });

  const parser = new DOMParser();
  const pinSvgString =
    '<svg width="102" height="120" viewBox="0 0 102 120" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M50.4811 6.89648C26.1072 6.89648 6.20703 26.396 6.20703 50.3366C6.20703 66.9634 16.9152 82.1292 27.105 93.3887C37.298 104.648 47.5074 112.135 47.5074 112.135C48.3584 112.764 49.3953 113.103 50.4648 113.103C51.531 113.103 52.568 112.764 53.419 112.135C53.419 112.135 63.6218 104.648 73.8116 93.3887C84.0013 82.1292 94.7128 66.9634 94.7128 50.3366C94.7128 26.396 74.855 6.89648 50.4811 6.89648Z" fill="#0E88EC" style="fill:#0E88EC;fill:color(display-p3 0.0553 0.5317 0.9262);fill-opacity:1;"/><path d="M47.3077 118.906L47.6007 118.501L47.6004 118.5L47.5989 118.499L47.5929 118.495L47.5683 118.477L47.4696 118.405C47.3822 118.341 47.2519 118.244 47.0818 118.117C46.7414 117.863 46.2413 117.484 45.6044 116.99C44.3305 116.002 42.5093 114.552 40.3238 112.704C35.952 109.009 30.1259 103.728 24.3061 97.3869C12.6444 84.6763 0.5 67.6644 0.5 49.0817C0.5 22.3235 23.0552 0.5 50.7139 0.5C78.3721 0.5 100.879 22.3229 100.879 49.0817C100.879 67.6644 88.7312 84.6762 77.0695 97.3869C71.2515 103.728 65.4282 109.009 61.0587 112.704C58.8743 114.552 57.0542 116.002 55.7811 116.99C55.1445 117.484 54.6447 117.863 54.3046 118.117C54.1345 118.244 54.0044 118.341 53.917 118.405L53.8184 118.477L53.7938 118.495L53.7878 118.499L53.7864 118.501L53.786 118.501L54.0792 118.906L53.786 118.501L53.7845 118.502C52.8967 119.149 51.8125 119.5 50.6952 119.5C49.5741 119.5 48.49 119.149 47.6023 118.502L47.6007 118.501L47.3077 118.906Z" stroke="#0E88EC" style="stroke:#0E88EC;stroke:color(display-p3 0.0553 0.5317 0.9262);stroke-opacity:1;"/><path d="M59.9612 62.3983L59.9133 62.4437L58.0652 60.7278L56.5947 59.3624L48.0234 51.4043V63.3516V65.3768V72.3343H49.5157V65.0774C52.208 64.4319 54.7004 63.2553 56.876 61.6648L59.9227 64.4936L59.9612 64.4572L59.9997 64.4936L70.4067 54.8311V72.3343H71.8989V51.4043L60.0091 62.4437L59.9612 62.3983ZM49.5157 63.0182V54.8311L55.3856 60.2811C53.6231 61.5134 51.6425 62.4502 49.5157 63.0182Z" fill="white" style="fill:white;fill-opacity:1;"/><path d="M62.0001 56.2915C64.1688 53.0113 65.4385 49.085 65.449 44.8739C65.4776 33.369 56.1696 24 44.7245 24C33.2794 24 23.9715 33.369 24.0001 44.8739C24.0284 56.2894 33.3093 65.6135 44.6719 65.642C44.6895 65.642 44.707 65.6418 44.7245 65.6418V72.3343H46.2167V65.5879V63.5861V47.2785L57.8198 58.2554L59.2666 59.6242L59.9601 60.2802L73.7034 47.2785V72.3343H75.1956V43.8075L62.0001 56.2915ZM44.7245 43.8075V63.6455C44.7086 63.6455 44.6928 63.6457 44.6768 63.6457C34.4036 63.6198 26.0127 55.1897 25.9871 44.8687C25.9613 34.4669 34.3769 25.9963 44.7245 25.9963C55.0722 25.9963 63.4877 34.4669 63.462 44.8687C63.4503 49.5635 61.7074 53.8666 58.8442 57.1659L44.7245 43.8075Z" fill="white" style="fill:white;fill-opacity:1;"/><path d="M32.3661 79.5548C31.6375 79.5548 31.099 79.3982 30.7506 79.0849C30.4056 78.7681 30.2332 78.2824 30.2332 77.6277C30.2332 76.9836 30.4109 76.5085 30.7664 76.2023C31.1219 75.8925 31.6727 75.7377 32.4189 75.7377C33.6578 75.7377 34.3301 76.1759 34.4357 77.0523H33.9394C33.8936 76.7531 33.7458 76.5331 33.4959 76.3923C33.2495 76.248 32.8905 76.1759 32.4189 76.1759C31.8276 76.1759 31.3982 76.2903 31.1307 76.519C30.8667 76.7443 30.7347 77.1156 30.7347 77.633C30.7347 78.1575 30.8649 78.5358 31.1254 78.7681C31.3859 79.0004 31.8065 79.1166 32.3872 79.1166C33.3938 79.1166 33.9288 78.791 33.9922 78.1399H34.4937C34.4515 78.6045 34.2474 78.9564 33.8813 79.1958C33.5188 79.4351 33.0137 79.5548 32.3661 79.5548ZM38.4062 79.4756H35.7506V75.8169H36.2574V79.0374H38.4062V79.4756ZM39.5669 78.1821V75.8169H40.0737V78.1821C40.0737 78.5059 40.1634 78.7435 40.343 78.8948C40.526 79.0427 40.8164 79.1166 41.2141 79.1166C41.6153 79.1166 41.9075 79.0427 42.0905 78.8948C42.277 78.7435 42.3703 78.5059 42.3703 78.1821V75.8169H42.8719V78.1821C42.8719 78.6467 42.7346 78.9916 42.46 79.2169C42.189 79.4421 41.7737 79.5548 41.2141 79.5548C40.6544 79.5548 40.2391 79.4439 39.9681 79.2222C39.7006 78.9969 39.5669 78.6502 39.5669 78.1821ZM46.9118 77.501V77.5697C47.3412 77.714 47.5559 78.0061 47.5559 78.4461C47.5559 78.7804 47.4433 79.0356 47.218 79.2116C46.9927 79.3876 46.6636 79.4756 46.2307 79.4756H44.2773V75.8169H46.1251C46.5334 75.8169 46.8467 75.8961 47.0649 76.0544C47.2831 76.2093 47.3922 76.4328 47.3922 76.7249C47.3922 77.084 47.2321 77.3426 46.9118 77.501ZM44.7788 76.2551V77.3532H46.1779C46.639 77.3532 46.8695 77.1614 46.8695 76.7777C46.8695 76.4293 46.6126 76.2551 46.0987 76.2551H44.7788ZM44.7788 77.7914V79.0374H46.2043C46.764 79.0374 47.0438 78.828 47.0438 78.4091C47.0438 78.2085 46.9663 78.0554 46.8115 77.9498C46.6601 77.8442 46.4401 77.7914 46.1515 77.7914H44.7788ZM53.7415 77.3532V75.8169H54.2483V79.4756H53.7415V77.7914H51.4238V79.4756H50.9169V75.8169H51.4238V77.3532H53.7415ZM57.7153 79.5548C56.9762 79.5548 56.4271 79.3982 56.0681 79.0849C55.7091 78.7716 55.5296 78.2894 55.5296 77.6383C55.5296 76.9942 55.7091 76.5173 56.0681 76.2075C56.4271 75.8943 56.9762 75.7377 57.7153 75.7377C58.458 75.7377 59.0088 75.8925 59.3678 76.2023C59.7269 76.512 59.9064 76.9907 59.9064 77.6383C59.9064 78.2894 59.7269 78.7716 59.3678 79.0849C59.0088 79.3982 58.458 79.5548 57.7153 79.5548ZM57.7153 79.1166C58.3031 79.1166 58.7308 78.9987 58.9983 78.7628C59.2693 78.527 59.4048 78.1522 59.4048 77.6383C59.4048 77.1244 59.271 76.7531 59.0036 76.5243C58.7361 76.292 58.3067 76.1759 57.7153 76.1759C57.124 76.1759 56.6946 76.2903 56.4271 76.519C56.1632 76.7478 56.0312 77.1209 56.0312 77.6383C56.0312 78.1557 56.1649 78.5323 56.4324 78.7681C56.7034 79.0004 57.1311 79.1166 57.7153 79.1166ZM61.1439 78.1821V75.8169H61.6508V78.1821C61.6508 78.5059 61.7405 78.7435 61.92 78.8948C62.103 79.0427 62.3934 79.1166 62.7911 79.1166C63.1924 79.1166 63.4845 79.0427 63.6675 78.8948C63.8541 78.7435 63.9474 78.5059 63.9474 78.1821V75.8169H64.4489V78.1821C64.4489 78.6467 64.3116 78.9916 64.0371 79.2169C63.7661 79.4421 63.3508 79.5548 62.7911 79.5548C62.2315 79.5548 61.8162 79.4439 61.5452 79.2222C61.2777 78.9969 61.1439 78.6502 61.1439 78.1821ZM67.3432 79.5548C66.773 79.5548 66.3541 79.4545 66.0866 79.2538C65.8227 79.0532 65.6819 78.7329 65.6643 78.293H66.15C66.1641 78.5886 66.2626 78.7998 66.4456 78.9265C66.6322 79.0532 66.9331 79.1166 67.3485 79.1166C68.0665 79.1166 68.4255 78.8966 68.4255 78.4566C68.4255 78.1293 68.2002 77.9304 67.7497 77.86L66.7571 77.7017C66.4228 77.6489 66.1764 77.5468 66.018 77.3954C65.8631 77.2441 65.7857 77.0347 65.7857 76.7672C65.7857 76.4363 65.9142 76.1829 66.1711 76.0069C66.4316 75.8274 66.8029 75.7377 67.2851 75.7377C67.7884 75.7377 68.165 75.8309 68.4149 76.0175C68.6683 76.2005 68.8162 76.4926 68.8584 76.8939H68.3621C68.334 76.6405 68.2337 76.4574 68.0612 76.3448C67.8922 76.2322 67.6318 76.1759 67.2798 76.1759C66.6111 76.1759 66.2767 76.3695 66.2767 76.7566C66.2767 77.0347 66.4879 77.2071 66.9102 77.274L67.887 77.4271C68.5768 77.5257 68.9218 77.8653 68.9218 78.4461C68.9218 78.8016 68.7862 79.0761 68.5152 79.2697C68.2442 79.4597 67.8535 79.5548 67.3432 79.5548ZM73.1428 79.4756H70.2285V75.8169H73.1006V76.2551H70.7354V77.3532H72.9317V77.7914H70.7354V79.0374H73.1428V79.4756Z" fill="white" style="fill:white;fill-opacity:1;"/></svg>';
  const pinSvg = parser.parseFromString(
    pinSvgString,
    "image/svg+xml",
  ).documentElement;

  new AdvancedMarkerElement({
    map,
    position: position,
    content: pinSvg,
    title: "A marker using a custom SVG image.",
  });
}


watch(props, async (newValue) => {
  initMap(newValue.itemData.location.coordinates[1], newValue.itemData.location.coordinates[0])
})

</script>
